Repository: Evg3n22/LibaryManagment
Catalog: LibaryManagment/SharedResource.*.resx
Languages: uk

# WelcomeMessage
source: Welcome to Our Library
uk: Ласкаво просимо до нашої програми!

# WelcomeTitle
source: Learn. Grow. Achieve.
uk: Вчись. Зростай. Досягай.

# LibrarySystemDesc
source: Efficiently manage all aspects of your library operations
uk: Ефективно керуйте всіма аспектами роботи вашої бібліотеки

# LibrarySystem
source: Library Management System
uk: Система управління бібліотекою

# HomeStudentCardTitle
source: Students
uk: Студенти

# HomeStudentCardDesc
source: Manage student records, enrollments, and maintain accurate information
uk: Управління даними студентів, реєстрацією та підтримка точності інформації

# HomeLibrariansCardTitle
source: Librarians
uk: Бібліотекарі

# HomeLibrariansCardDesc
source: Oversee staff management and coordinate library operations
uk: Контролювати управління персоналом та координувати роботу бібліотеки

# HomeLibrariansCardBtn
source: Manage Librarians
uk: Керувати бібліотекарями

# HomeBorrowingCardTitle
source: Borrowing
uk: Запозичення

# HomeBorrowingCardDesc
source: Track book loans, returns, and manage borrowing schedules
uk: Відстежуйте позики книг, повернення та керуйте графіками позичання

# HomeBorrowingCardBtn
source: Manage Borrowing
uk: Управління позиками

# HomeBookCardTitle
source: Books
uk: Книги

# HomeBookCardDesc
source: Catalog and track your entire book collection with ease
uk: Легко каталогізуйте та відстежуйте всю свою колекцію книг

# HomeBookCardBtn
source: Manage Books
uk: Керувати книгами

# HomeAuthorsCardTitle
source: Authors
uk: Автори

# HomeAuthorsCardDesc
source: Curate author profiles, biographies, and link them to their works
uk: Створюйте профілі авторів, біографії та пов'язуйте їх з їхніми творами

# HomeAuthorsCardBtn
source: Manage Authors
uk: Керувати авторами

# HeaderStudent
source: Student
uk: Студенти

# HeaderHome
source: Home
uk: Головна

# HeaderAuthor
source: Author
uk: Автори

# Footer
source: © 2025 - LibaryManagment - made by Evgen Gulevaty and Vladyslav Yampol
uk: © 2025 - LibaryManagment - створено Євгеном Гулеватим та Владиславом Ямполем

# HomeStudentCardBtn
source: Manage Students
uk: Управління студентами

# HeaderLibrarians
source: Librarians
uk: Бібліотекарі

# HeaderLogin
source: Login
uk: Увійти

# HeaderLogout
source: Logout
uk: Вийти

# HeaderBook
source: Books
uk: Книги

# HeaderBorrowing
source: Borrowing
uk: Запозичення

# LoginTitle
source: Login
uk: Увійти

# Login_Button_Submit
source: Login
uk: Увійти

# Login_Footer
source: © 2025 Library Management System
uk: © 2025 Система управління бібліотекою

# Login_JS_LoggingIn
source: Logging in...
uk: Входимо...

# Login_Label_Password
source: Password
uk: Пароль

# Login_Label_Username
source: Username
uk: Ім'я користувача

# Login_PageTitle
source: Login
uk: Вхід

# Login_Placeholder_Password
source: Enter your password
uk: Введіть ваш пароль

# Login_Placeholder_Username
source: Enter your username
uk: Введіть ваше ім'я користувача

# Login_Subtitle
source: Log in to the Library Management System
uk: Увійдіть до системи управління бібліотекою

# Login_Title
source: Login
uk: Вхід

# Global_Btn_Delete
source: Delete
uk: Видалити

# Global_Btn_Edit
source: Edit
uk: Редагувати

# Global_Confirm_Delete
source: Are you sure?
uk: Ви впевнені?

# Student_Index_Btn_Add
source: Add New Student
uk: Додати студента

# Student_Index_Title
source: Students
uk: Студенти

# Student_Table_Header_Actions
source: Actions
uk: Дії

# Student_Table_Header_Id
source: Student ID
uk: ID Студента

# Student_Table_Header_Name
source: Student Name
uk: Ім'я студента

# Student_Table_Header_Phone
source: Phone
uk: Телефон

# Global_Btn_Add
source: Add
uk: Додати

# Global_Btn_Cancel
source: Cancel
uk: Скасувати

# Student_Create_Title
source: Add Student
uk: Додати студента

# Student_Label_Name
source: Student Name
uk: Ім'я студента

# Student_Label_Password
source: Password
uk: Пароль

# Student_Label_Phone
source: Phone
uk: Телефон

# Global_Btn_Update
source: Update
uk: Оновити

# Student_Edit_Title
source: Edit Student
uk: Редагувати студента

# Author_Confirm_Delete
source: Are you sure you want to delete this author?
uk: Ви впевнені, що хочете видалити цього автора?

# Author_Image_Placeholder
source: No Image
uk: Немає фото

# Author_Index_Btn_Add
source: Add New Author
uk: Додати нового автора

# Author_Index_Title
source: Authors
uk: Автори

# Author_Table_Header_Actions
source: Actions
uk: Дії

# Author_Table_Header_BirthYear
source: Birth Year
uk: Рік народження

# Author_Table_Header_Country
source: Country
uk: Країна

# Author_Table_Header_Description
source: Description
uk: Опис

# Author_Table_Header_Image
source: Image
uk: Фото

# Author_Table_Header_Name
source: Author Name
uk: Ім'я автора

# Global_Btn_ViewDetails
source: View Details
uk: Детальніше

# Author_Create_Title
source: Add Author
uk: Додати автора

# Author_Label_BirthYear
source: Birth Year
uk: Рік народження

# Author_Label_Country
source: Country
uk: Країна

# Author_Label_Description
source: Description
uk: Опис

# Author_Label_Image
source: Author Image
uk: Фото автора

# Author_Label_Name
source: Author Name
uk: Ім'я автора

# Author_Edit_Title
source: Edit Author
uk: Редагувати автора

# Author_Label_ChangeImage
source: Change Image (optional)
uk: Змінити фото (необов'язково)

# Author_Label_CurrentImage
source: Current Image
uk: Поточне фото

# Author_Text_NoImage
source: No image uploaded
uk: Фото не завантажено

# Global_Help_KeepImage
source: Leave empty to keep the current image
uk: Залиште порожнім, щоб зберегти поточне фото

# Author_Details_Header_About
source: About {0}
uk: Про {0}

# Author_Details_Header_BooksBy
source: Books by {0}
uk: Книги {0}

# Author_Details_Label_Biography
source: Biography
uk: Біографія

# Author_Details_Label_BooksCount
source: Books in Library
uk: Книг у бібліотеці

# Author_Details_Label_QuickInfo
source: Quick Info
uk: Коротка інформація

# Author_Details_NoBooks
source: No books by this author in the library yet.
uk: У бібліотеці поки що немає книг цього автора.

# Author_Details_Title
source: Author Details
uk: Деталі про автора

# Book_Status_Available
source: Available ({0})
uk: Доступно ({0})

# Book_Status_NotAvailable
source: Not Available
uk: Немає в наявності

# Book_Table_Header_Actions
source: Actions
uk: Дії

# Book_Table_Header_Availability
source: Availability
uk: Наявність

# Book_Table_Header_Publisher
source: Publisher
uk: Видавництво

# Book_Table_Header_Title
source: Book Title
uk: Назва книги

# Book_Table_Header_Year
source: Year
uk: Рік

# Global_Btn_Back
source: Back to List
uk: Назад до списку

# Global_Btn_View
source: View
uk: Переглянути

# Book_Card_ByAuthor
source: by {0}
uk: автор: {0}

# Book_Card_Label_ID
source: Book ID
uk: ID Книги

# Book_Confirm_Delete
source: Are you sure you want to delete this book?
uk: Ви впевнені, що хочете видалити цю книгу?

# Book_Empty_Text
source: Try adjusting your filters or search terms
uk: Спробуйте змінити фільтри або умови пошуку

# Book_Empty_Title
source: No books found matching your search criteria
uk: Книг за вашим запитом не знайдено

# Book_Filter_Btn_Apply
source: Apply Filters
uk: Застосувати фільтри

# Book_Filter_Btn_Clear
source: Clear
uk: Очистити

# Book_Filter_Label_Availability
source: Availability
uk: Наявність

# Book_Filter_Label_Category
source: Category
uk: Категорія

# Book_Filter_Label_Year
source: Year
uk: Рік

# Book_Filter_Option_AllBooks
source: All Books
uk: Всі книги

# Book_Filter_Option_AllCategories
source: All Categories
uk: Всі категорії

# Book_Filter_Option_AllYears
source: All Years
uk: Всі роки

# Book_Filter_Option_Available
source: Available Only
uk: Тільки доступні

# Book_Filter_Option_Unavailable
source: Unavailable Only
uk: Тільки недоступні

# Book_Index_Btn_Add
source: Add New Book
uk: Додати нову книгу

# Book_Index_ResultsCount
source: Showing {0} books
uk: Відображено {0} книг

# Book_Index_TabTitle
source: Books
uk: Книги

# Book_Index_Title
source: Library Books
uk: Книги бібліотеки

# Book_Search_Placeholder
source: Search book title (use author: or publisher: for specific search)...
uk: Пошук за назвою (або author: чи publisher:)...

# Book_Search_Tooltip
source: Examples: 'Harry Potter', 'author:Tolkien', 'publisher:Penguin'
uk: Приклади: 'Harry Potter', 'author:Tolkien', 'publisher:Penguin'

# Book_Status_AvailableCount
source: {0} / {1} Available
uk: {0} / {1} Доступно

# Global_Btn_Moderate
source: Moderate Reviews
uk: Модерувати відгуки

# Book_Create_Header
source: Create New Book
uk: Створити нову книгу

# Book_Create_Title
source: Create Book
uk: Створити книгу

# Book_Label_Author
source: Author
uk: Автор

# Book_Label_CategoryID
source: Category ID
uk: ID Категорії

# Book_Label_CopiesAvailable
source: Copies Available
uk: Доступно примірників

# Book_Label_CopiesTotal
source: Copies Total
uk: Всього примірників

# Book_Label_Description
source: Description
uk: Опис

# Book_Label_Image
source: Book Cover Image
uk: Обкладинка книги

# Book_Label_Publisher
source: Publisher
uk: Видавництво

# Book_Label_Title
source: Book Name
uk: Назва книги

# Book_Label_Year
source: Year of Publication
uk: Рік видання

# Book_Placeholder_Publisher
source: Publisher name
uk: Назва видавництва

# Book_Placeholder_Title
source: Enter book title
uk: Введіть назву книги

# Book_Placeholder_Year
source: e.g. 2023
uk: напр. 2023

# Book_Select_DefaultAuthor
source: -- Select Author --
uk: -- Оберіть автора --

# Book_Edit_Title
source: Edit Book
uk: Редагувати книгу

# Book_Details_Label_AvailableCopies
source: Available Copies
uk: Доступні копії

# Book_Details_Title
source: Book Details
uk: Деталі книги

# Review_Btn_Post
source: Post
uk: Надіслати

# Review_Form_Title
source: Leave a Review
uk: Залишити відгук

# Review_Header_Title
source: User Reviews
uk: Відгуки користувачів

# Review_Label_Comment
source: Your Comment
uk: Ваш коментар

# Review_Label_Rating
source: Rating
uk: Оцінка

# Review_Link_Login
source: login
uk: увійдіть

# Review_Placeholder_Comment
source: Write your thoughts here...
uk: Напишіть ваші думки тут...

# Review_Text_Empty
source: No reviews yet. Be the first to review!
uk: Відгуків ще немає. Будьте першими!

# Review_Text_Please
source: Please
uk: Будь ласка,

# Review_Text_PostedOn
source: Posted on {0}
uk: Опубліковано {0}

# Review_Text_ToLeaveReview
source: to leave a review.
uk: , щоб залишити відгук.

# Review_Confirm_Delete
source: ⚠️ Are you sure you want to DELETE this review permanently?
uk: ⚠️ Ви впевнені, що хочете НАЗАВЖДИ видалити цей відгук?

# Review_Mod_Alert_Body
source: You are viewing reviews for <strong>{0}</strong>. You have the authority to delete offensive or inappropriate content.
uk: Ви переглядаєте відгуки для <strong>{0}</strong>. Ви маєте повноваження видаляти образливий або неприйнятний вміст.

# Review_Mod_Alert_Label
source: Moderator Mode:
uk: Режим модератора:

# Review_Mod_Btn_Back
source: Back to Books
uk: Назад до книг

# Review_Mod_Empty_Desc
source: Good job! Nothing to moderate here.
uk: Чудова робота! Тут нічого модерувати.

# Review_Mod_Empty_Title
source: No reviews found for this book.
uk: Відгуків для цієї книги не знайдено.

# Review_Mod_Header
source: Moderation Panel
uk: Панель модерації

# Review_Mod_Title
source: Moderation Panel
uk: Панель модерації

# Review_Table_Content
source: Content
uk: Вміст

# Review_Table_Date
source: Date
uk: Дата

# Review_Table_User
source: User
uk: Користувач

# Borrowing_Btn_Issue
source: Issue a Book
uk: Видати книгу

# Borrowing_Btn_Queue
source: View Queue
uk: Переглянути чергу

# Borrowing_Btn_Return
source: Return
uk: Повернути

# Borrowing_Confirm_Delete
source: Are you sure you want to delete this record?
uk: Ви впевнені, що хочете видалити цей запис?

# Borrowing_Empty
source: No records found
uk: Записів не знайдено

# Borrowing_Index_Title
source: Book Borrowings
uk: Видача книг

# Borrowing_Queue_Since
source: since
uk: з

# Borrowing_Queue_UserMessage
source: You are in queue for the following books:
uk: Ви у черзі на отримання наступних книг:

# Borrowing_Status_Borrowed
source: Borrowed
uk: Видано

# Borrowing_Status_NotReturned
source: Not Returned
uk: Не повернуто

# Borrowing_Status_Returned
source: Returned
uk: Повернуто

# Borrowing_Table_Header_Book
source: Book
uk: Книга

# Borrowing_Table_Header_BorrowDate
source: Borrow Date
uk: Дата видачі

# Borrowing_Table_Header_ReturnDate
source: Return Date
uk: Дата повернення

# Borrowing_Table_Header_Status
source: Status
uk: Статус

# Borrowing_Table_Header_Student
source: Student
uk: Студент

# Borrowing_Btn_IssueOrQueue
source: Issue / Add to Queue
uk: Видати / Додати в чергу

# Borrowing_Create_Header
source: Issue Book to Student
uk: Видати книгу студенту

# Borrowing_Create_Title
source: Issue Book
uk: Видача книги

# Borrowing_JS_Available
source: The book can be issued now!
uk: Книгу можна видати зараз!

# Borrowing_JS_Keyword_Available
source: Available
uk: Доступно

# Borrowing_JS_Keyword_Queue
source: Not available
uk: Недоступно

# Borrowing_JS_Queue
source: The student will be added to the waiting queue.
uk: Студента буде додано до черги очікування.

# Borrowing_Note_Body
source: If a book is not available, the student will automatically be added to the waiting queue.
uk: Якщо книга недоступна, студента буде автоматично додано до черги очікування.

# Borrowing_Note_Label
source: Note:
uk: Примітка:

# Borrowing_Option_Available
source: (✓ Available: {0} copies)
uk: (✓ Доступно: {0} копій)

# Borrowing_Option_Queue
source: (⏳ Not available - will be added to the queue)
uk: (⏳ Недоступно - буде додано в чергу)

# Borrowing_Select_DefaultBook
source: -- Select a book --
uk: -- Оберіть книгу --

# Borrowing_Select_DefaultStudent
source: -- Select a student --
uk: -- Оберіть студента --

# Borrowing_Edit_Title
source: Edit Borrowing Record
uk: Редагувати запис про видачу

# Global_Btn_Remove
source: Remove
uk: Видалити

# Global_Time_Days
source: days
uk: дн.

# Global_Time_Hours
source: hours
uk: год.

# Global_Time_Minutes
source: minutes
uk: хв.

# Queue_Badge_Next
source: Next
uk: Наступний

# Queue_Confirm_Remove
source: Are you sure you want to remove {0} from the queue for the book {1}?
uk: Ви впевнені, що хочете видалити студента {0} з черги на книгу {1}?

# Queue_Empty_Text
source: There are currently no students waiting for books.
uk: На даний момент студентів, що очікують книги, немає.

# Queue_Empty_Title
source: The queue is empty
uk: Черга порожня

# Queue_Header_Title
source: Book Waiting Queue
uk: Черга очікування книг

# Queue_Help_Bullet1
source: When a book is returned, it is automatically issued to the first student in the queue.
uk: Коли книгу повертають, вона автоматично видається першому студенту в черзі.

# Queue_Help_Bullet2
source: Students with the "Next" tag will receive the book first.
uk: Студенти з позначкою "Наступний" отримають книгу першими.

# Queue_Help_Bullet3
source: The yellow background indicates the student who will receive the book next.
uk: Жовтий фон вказує на студента, який отримає книгу найближчим часом.

# Queue_Help_Title
source: How the queue works:
uk: Як працює черга:

# Queue_Page_Title
source: Book Queue
uk: Черга на книги

# Queue_Table_Position
source: Position
uk: Позиція

# Queue_Table_RequestDate
source: Request Date
uk: Дата запиту

# Queue_Table_WaitingTime
source: Waiting Time
uk: Час очікування

# Queue_Text_Total
source: Total in queue: {0} students
uk: Всього в черзі: {0} студентів

# Librarian_Index_Btn_Add
source: Add New Librarian
uk: Додати бібліотекаря

# Librarian_Index_Title
source: Librarians
uk: Бібліотекарі

# Librarian_Table_Header_Actions
source: Actions
uk: Дії

# Librarian_Table_Header_Age
source: Age
uk: Вік

# Librarian_Table_Header_Id
source: Librarian ID
uk: ID Бібліотекаря

# Librarian_Table_Header_Name
source: Name
uk: Ім'я

# Librarian_Table_Header_Phone
source: Phone
uk: Телефон

# Librarian_Create_Title
source: Add Librarian
uk: Додати бібліотекаря

# Librarian_Label_Age
source: Age
uk: Вік

# Librarian_Label_Name
source: Name
uk: Ім'я

# Librarian_Label_Password
source: Password
uk: Пароль

# Librarian_Label_Phone
source: Phone
uk: Телефон

# Librarian_Edit_Title
source: Edit Librarian
uk: Редагувати бібліотекаря
